app/Controllers/FormularioController.php

    public function historicoMedico($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function sintomasAtuais($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function examesDiagnosticos($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function estiloVida($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function notasPlanoTratamento($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function confirmacao($id)
    {
        $model = new PacienteModel();
        $data['paciente'] = $model->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '8'

    public function listarPacientes()
    {
        $model = new PacienteModel();
        $data['pacientes'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `pacientes`
ORDER BY `id` DESC